Revit 2024 API
SATImportOptions Constructor (SATImportOptions)
 Constructs a new instance of SATImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public SATImportOptions(
	SATImportOptions option
)
Visual Basic
Public Sub New ( _
	option As SATImportOptions _
)
Visual C++
public:
SATImportOptions(
	SATImportOptions^ option
)
Parameters
option
Type: Autodesk.Revit.DB.SATImportOptions
 The SAT options to be copied.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SATImportOptions Class
SATImportOptions Overload
Autodesk.Revit.DB Namespace